update readme : mermaid, 프로젝트 구성 추가
